exampleCases/tut.ABLflatTerrain.precursor/0.original/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
   location    "0";
    object      k ;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

 
dimensions      [0 2 -2 0 0 0 0];
 
internalField   uniform $k0;

boundaryField
{
    lower
    {
        type            zeroGradient;
    }
    upper
    {
        type            zeroGradient;
    }
    east
    {
        type            cyclic;
    }
    west
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
    north
    {
        type            cyclic;
    }
}


// ************************************************************************* //
