exampleCases/tut.ABLflatTerrain.precursor/system/controlDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       ABLSolver;

  libs              ("libSOWFAboundaryConditions.so" "libSOWFAincompressibleTurbulenceModels.so");

  startFrom         startTime;

//startTime         0.0;
  startTime         20000.0;

  stopAt            endTime;

//endTime           20000.0;
  endTime           23600.0;

  deltaT            0.5;

  writeControl      adjustableRunTime;

//writeInterval     1000.0; 
  writeInterval     3600.0; 

  purgeWrite        0;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  uncompressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    yes;

  maxCo             0.75;

  maxDeltaT         25.0;

  functions
  {
      #include "sampling/planarAveraging"
      #include "sampling/boundaryData"
  }

// ************************************************************************* //

