exampleCases/tut.ABLflatTerrain.precursor/system/sampling/fieldAverages
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
fieldAverages
{
    type            fieldAverage;
    functionObjectLibs ( "libfieldFunctionObjects.so" );
    enabled         true;
    writeControl    writeTime;
    timeStart       200;
    fields          ( U { mean on ; prime2Mean on ; base time ; } );
}


// ************************************************************************* //
